In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

# Series

In [3]:
mylist = [100,200,300,400,500]
print(type(mylist))

<class 'list'>

In [4]:
ps1 = Series(mylist)
print(ps1)
print(type(ps1))

0    100
1    200
2    300
3    400
4    500
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
ps1.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
print(type(ps1.index))

<class 'pandas.core.indexes.range.RangeIndex'>

In [6]:
ps1.values

array([100, 200, 300, 400, 500], dtype=int64)

In [9]:
print(type(ps1.values))

<class 'numpy.ndarray'>

In [10]:
ps1.ndim

1

In [11]:
ps1.shape

(5,)

In [13]:
ps1.count()   # 5 elements in series

5

In [14]:
ps1.describe() #summary statictics

count      5.000000
mean     300.000000
std      158.113883
min      100.000000
25%      200.000000
50%      300.000000
75%      400.000000
max      500.000000
dtype: float64

In [15]:
ps1.mean()

300.0

In [16]:
ps1.std()

158.11388300841898

In [17]:
ps1.var()

25000.0

In [20]:
mylist = [100,200,100,400,100,200,300,700]
print(type(mylist))
ps1 = Series(mylist)
print(ps1)

<class 'list'>
0    100
1    200
2    100
3    400
4    100
5    200
6    300
7    700
dtype: int64

In [21]:
mylist = [100,200,100,400,100,200,300,700]
print(type(mylist))

ilist= ['Tata','Birla','Infy','Wipro','HCL','ITC','Adani','TCS']

ps1 = Series(mylist , index =  ilist)
print(ps1)

<class 'list'>
Tata     100
Birla    200
Infy     100
Wipro    400
HCL      100
ITC      200
Adani    300
TCS      700
dtype: int64

In [22]:
ps1.index

Index(['Tata', 'Birla', 'Infy', 'Wipro', 'HCL', 'ITC', 'Adani', 'TCS'], dtype='object')

In [23]:
ps1.count()    #count the total number of elements in series

8

In [27]:
x =ps1.value_counts()     #gives count of each value
print(x)
print(type(x))

100    3
200    2
400    1
700    1
300    1
dtype: int64
<class 'pandas.core.series.Series'>

In [28]:
x.index

Int64Index([100, 200, 400, 700, 300], dtype='int64')

In [29]:
x.values

array([3, 2, 1, 1, 1], dtype=int64)

In [30]:
ps1

Tata     100
Birla    200
Infy     100
Wipro    400
HCL      100
ITC      200
Adani    300
TCS      700
dtype: int64

In [31]:
ps1['Tata']

100

In [32]:
ps1["QC"]        #key error means key is not present

KeyError: 'QC'

In [33]:
md1 = {"Tata" : 1000, "Birla" : 2000, "Wipro" : 3000 , "Infy" : 4000}

In [34]:
md1

{'Tata': 1000, 'Birla': 2000, 'Wipro': 3000, 'Infy': 4000}

In [35]:
type(md1)

dict

In [36]:
ps2 = Series(md1)

In [37]:
ps2

Tata     1000
Birla    2000
Wipro    3000
Infy     4000
dtype: int64

# Series

In [39]:
np.random.seed(23)

n10 = np.random.randint(low = 10 ,high = 20 , size = 10 )


ilist= ['Tata','Birla','Infy','Wipro','HCL','ITC','Adani','TCS','LT','MM']

ps1 = Series(n10 , index =  ilist)
print(ps1)

Tata     13
Birla    16
Infy     18
Wipro    19
HCL      16
ITC      18
Adani    17
TCS      19
LT       13
MM       16
dtype: int32

In [41]:
ps1.value_counts()

16    3
13    2
19    2
18    2
17    1
dtype: int64

In [42]:
ps1.unique()               #return unique indices

array([13, 16, 18, 19, 17])

In [43]:
ps1

Tata     13
Birla    16
Infy     18
Wipro    19
HCL      16
ITC      18
Adani    17
TCS      19
LT       13
MM       16
dtype: int32

In [44]:
ps1[0]

13

In [45]:
ps1[-1]

16

In [46]:
ps1['Tata']

13

In [47]:
ps1['TCS']

19

In [48]:
ps1[1:4]

Birla    16
Infy     18
Wipro    19
dtype: int32

In [51]:
ps1["Birla":"HCL"]      # if you give string slice then end point is also included

Birla    16
Infy     18
Wipro    19
HCL      16
dtype: int32

In [52]:
ps1["Birla":"HCL" : 2]

Birla    16
Wipro    19
dtype: int32

In [53]:
#to pull out arbitrarily pass a vector
ps1[ ["TCS","MM","Wipro","Infy","Tata"]]

TCS      19
MM       16
Wipro    19
Infy     18
Tata     13
dtype: int32

# Mutability

In [54]:
ps1

Tata     13
Birla    16
Infy     18
Wipro    19
HCL      16
ITC      18
Adani    17
TCS      19
LT       13
MM       16
dtype: int32

In [55]:
ps1["Tata"] = 113

In [56]:
ps1

Tata     113
Birla     16
Infy      18
Wipro     19
HCL       16
ITC       18
Adani     17
TCS       19
LT        13
MM        16
dtype: int32

# Boolean Vector

In [57]:
ps1 > 15

Tata      True
Birla     True
Infy      True
Wipro     True
HCL       True
ITC       True
Adani     True
TCS       True
LT       False
MM        True
dtype: bool

In [58]:
ps1[ps1>15]

Tata     113
Birla     16
Infy      18
Wipro     19
HCL       16
ITC       18
Adani     17
TCS       19
MM        16
dtype: int32

In [60]:
(ps1>15) & (ps1%2==0)

Tata     False
Birla     True
Infy      True
Wipro    False
HCL       True
ITC       True
Adani    False
TCS      False
LT       False
MM        True
dtype: bool

In [61]:
ps1[(ps1>15) & (ps1%2==0)]

Birla    16
Infy     18
HCL      16
ITC      18
MM       16
dtype: int32

# Data Frames


        Vol  Rev  Exp  HQ
Tata    100  110  120  Mum
Birla   200  210  220  Kol
Wipro   300  310  320  Blr
Infy    400  410  420  Blr

In [62]:
#Different methods to generate Data Frame
#1) using a dictionary (columnar entries)
#2) using a list(row wise entries)

In [63]:
md1 = {"Vol" : [100,200,300,400],
       "Rev" : [110,210,310,410],
       "Exp" : [120,220,320,420],
       "HQ"  : ["Mum","Kol","Blr","Blr"]}

In [64]:
md1

{'Vol': [100, 200, 300, 400],
 'Rev': [110, 210, 310, 410],
 'Exp': [120, 220, 320, 420],
 'HQ': ['Mum', 'Kol', 'Blr', 'Blr']}

In [65]:
df1 =  DataFrame(md1)

In [66]:
df1

   Vol  Rev  Exp   HQ
0  100  110  120  Mum
1  200  210  220  Kol
2  300  310  320  Blr
3  400  410  420  Blr

In [ ]:
#take a look mate bydefault indexes are displayed

In [67]:
row_index_list =  ["Tata","Birla","Wipro","Infy"]

In [68]:
df1 =  DataFrame(md1 , index = row_index_list)

In [69]:
df1

       Vol  Rev  Exp   HQ
Tata   100  110  120  Mum
Birla  200  210  220  Kol
Wipro  300  310  320  Blr
Infy   400  410  420  Blr

In [70]:
df1.index

Index(['Tata', 'Birla', 'Wipro', 'Infy'], dtype='object')

In [71]:
df1.columns

Index(['Vol', 'Rev', 'Exp', 'HQ'], dtype='object')

In [75]:
df1.values

array([[100, 110, 120, 'Mum'],
       [200, 210, 220, 'Kol'],
       [300, 310, 320, 'Blr'],
       [400, 410, 420, 'Blr']], dtype=object)

In [79]:
df1.count()

Vol    4
Rev    4
Exp    4
HQ     4
dtype: int64

In [80]:
df1.describe()

              Vol         Rev         Exp
count    4.000000    4.000000    4.000000
mean   250.000000  260.000000  270.000000
std    129.099445  129.099445  129.099445
min    100.000000  110.000000  120.000000
25%    175.000000  185.000000  195.000000
50%    250.000000  260.000000  270.000000
75%    325.000000  335.000000  345.000000
max    400.000000  410.000000  420.000000

In [81]:
df1.describe(include = 'all')        #include all means non numerical data is also displayed

               Vol         Rev         Exp   HQ
count     4.000000    4.000000    4.000000    4
unique         NaN         NaN         NaN    3
top            NaN         NaN         NaN  Blr
freq           NaN         NaN         NaN    2
mean    250.000000  260.000000  270.000000  NaN
std     129.099445  129.099445  129.099445  NaN
min     100.000000  110.000000  120.000000  NaN
25%     175.000000  185.000000  195.000000  NaN
50%     250.000000  260.000000  270.000000  NaN
75%     325.000000  335.000000  345.000000  NaN
max     400.000000  410.000000  420.000000  NaN

In [ ]:
#NaN means not a number its a null value

In [ ]:
#Method 2: using list(row wise)

        Vol  Rev  Exp  HQ
Tata    100  110  120  Mum
Birla   200  210  220  Kol
Wipro   300  310  320  Blr
Infy    400  410  420  Blr

In [88]:
mylist1 = [[100,110,120,"Mum"] , [200,210,220,"Kol"] , [300,310,320,"Blr"] , [400,410,420,"Blr"] ]
row_index_list =  ["Tata","Birla","Wipro","Infy"]
col_index_list =  [ "Vol","Rev","Exp","HQ" ]

In [84]:
mylist1

[[100, 110, 120, 'Mum'],
 [200, 210, 220, 'Kol'],
 [300, 310, 320, 'Blr'],
 [400, 410, 420, 'Blr']]

In [85]:
df2 = DataFrame(mylist1)

In [86]:
df2

     0    1    2    3
0  100  110  120  Mum
1  200  210  220  Kol
2  300  310  320  Blr
3  400  410  420  Blr

In [89]:
df2 = DataFrame(mylist1 , index = row_index_list ,  columns = col_index_list)
df2

       Vol  Rev  Exp   HQ
Tata   100  110  120  Mum
Birla  200  210  220  Kol
Wipro  300  310  320  Blr
Infy   400  410  420  Blr

In [90]:
df2.ndim

2

In [91]:
df2.shape

(4, 4)

In [92]:
df1 =  pd.read_csv('lds1.csv')

In [93]:
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Indi_Services        954  733.0  609  Gov   13023  NCR

In [94]:
#check for current directory 
import os
os.getcwd()
#!dir

'C:\\Users\\Netra'

In [95]:
df1.describe()

              Vol         Rev         Exp        EmpCnt
count    9.000000    9.000000    9.000000      9.000000
mean   940.444444  844.277778  666.333333   2469.333333
std     31.460734   53.389788   90.689029   4006.439036
min    899.000000  733.000000  605.000000    119.000000
25%    925.000000  821.000000  609.000000   1154.000000
50%    931.000000  863.200000  650.000000   1379.000000
75%    966.000000  874.400000  674.000000   1656.000000
max    992.000000  917.000000  895.000000  13023.000000

In [96]:
df1.describe(include="all")  #include = "all" includes non numerical columns also

               Vol         Rev         Exp Catg        EmpCnt   HQ
count     9.000000    9.000000    9.000000    9      9.000000    9
unique         NaN         NaN         NaN    3           NaN    5
top            NaN         NaN         NaN  Pub           NaN  NCR
freq           NaN         NaN         NaN    5           NaN    2
mean    940.444444  844.277778  666.333333  NaN   2469.333333  NaN
std      31.460734   53.389788   90.689029  NaN   4006.439036  NaN
min     899.000000  733.000000  605.000000  NaN    119.000000  NaN
25%     925.000000  821.000000  609.000000  NaN   1154.000000  NaN
50%     931.000000  863.200000  650.000000  NaN   1379.000000  NaN
75%     966.000000  874.400000  674.000000  NaN   1656.000000  NaN
max     992.000000  917.000000  895.000000  NaN  13023.000000  NaN

In [97]:
df1.info()                          #object is non numerical in nature

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, Kolkata_FMCG to Indi_Services
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Vol     9 non-null      int64
 1   Rev     9 non-null      float64
 2   Exp     9 non-null      int64
 3   Catg    9 non-null      object
 4   EmpCnt  9 non-null      int64
 5   HQ      9 non-null      object
dtypes: float64(1), int64(3), object(2)
memory usage: 504.0+ bytes

In [98]:
df1.count()     #bydefault axis is 0 (0 means column in pandas)

Vol       9
Rev       9
Exp       9
Catg      9
EmpCnt    9
HQ        9
dtype: int64

In [99]:
df1.count(axis = 1)     #axis 1 means row in pandas

Kolkata_FMCG           6
NCR_Leagles            6
Bombay_Sporting        6
Bombay_Finance         6
Bangalore_Systems      6
Chennai_Shipping       6
Bangalore_Breweries    6
Chennai_Chemicals      6
Indi_Services          6
dtype: int64

In [100]:
pd.__version__

'1.1.3'

In [101]:
df1.value_counts()                    #in data frame take entire row as entry and checks the count

Vol  Rev    Exp  Catg  EmpCnt  HQ
992  821.0  665  Pub   1154    Che    1
966  863.2  608  Pub   1656    Che    1
     805.0  895  Pvt   119     Blr    1
954  733.0  609  Gov   13023   NCR    1
931  881.6  650  Gov   1361    Blr    1
     863.5  605  Pub   1935    NCR    1
925  839.8  615  Pvt   154     Mum    1
900  874.4  676  Pub   1379    Kol    1
899  917.0  674  Pub   1443    Mum    1
dtype: int64

# Access of DataFrame

In [102]:
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Indi_Services        954  733.0  609  Gov   13023  NCR

In [104]:
x = df1['Vol'] 
print(x)
print(type(x))

Kolkata_FMCG           900
NCR_Leagles            931
Bombay_Sporting        925
Bombay_Finance         899
Bangalore_Systems      931
Chennai_Shipping       992
Bangalore_Breweries    966
Chennai_Chemicals      966
Indi_Services          954
Name: Vol, dtype: int64
<class 'pandas.core.series.Series'>

In [105]:
x = df1[['Vol','Exp']] 
print(x)
print(type(x))

                     Vol  Exp
Kolkata_FMCG         900  676
NCR_Leagles          931  605
Bombay_Sporting      925  615
Bombay_Finance       899  674
Bangalore_Systems    931  650
Chennai_Shipping     992  665
Bangalore_Breweries  966  895
Chennai_Chemicals    966  608
Indi_Services        954  609
<class 'pandas.core.frame.DataFrame'>

In [ ]:
dir(df1)       #columns get dynamically added into the Data Frame object

In [ ]:
#we can access the columns of DataFrame using . operator

In [108]:
df1.Vol

Kolkata_FMCG           900
NCR_Leagles            931
Bombay_Sporting        925
Bombay_Finance         899
Bangalore_Systems      931
Chennai_Shipping       992
Bangalore_Breweries    966
Chennai_Chemicals      966
Indi_Services          954
Name: Vol, dtype: int64

In [111]:
df1.HQ

Kolkata_FMCG           Kol
NCR_Leagles            NCR
Bombay_Sporting        Mum
Bombay_Finance         Mum
Bangalore_Systems      Blr
Chennai_Shipping       Che
Bangalore_Breweries    Blr
Chennai_Chemicals      Che
Indi_Services          NCR
Name: HQ, dtype: object

In [112]:
df1['NCR_Leagles']      # you cannot acces a row like this

KeyError: 'NCR_Leagles'

In [113]:
#column vector
df1[['Vol','Exp','HQ']]

                     Vol  Exp   HQ
Kolkata_FMCG         900  676  Kol
NCR_Leagles          931  605  NCR
Bombay_Sporting      925  615  Mum
Bombay_Finance       899  674  Mum
Bangalore_Systems    931  650  Blr
Chennai_Shipping     992  665  Che
Bangalore_Breweries  966  895  Blr
Chennai_Chemicals    966  608  Che
Indi_Services        954  609  NCR

In [114]:
#row vector dont work
df1[['Bombay_Sporting','Chennai_Chemicals']]

KeyError: "None of [Index(['Bombay_Sporting', 'Chennai_Chemicals'], dtype='object')] are in the [columns]"

In [115]:
#silicing not allowed
df1['Vol':'Catg']

KeyError: 'Vol'

In [116]:
df1['Bombay_Sporting':'Chennai_Chemicals']

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che

In [117]:
df1['Bombay_Sporting':'Bombay_Sporting']

                 Vol    Rev  Exp Catg  EmpCnt   HQ
Bombay_Sporting  925  839.8  615  Pvt     154  Mum

In [118]:
bool_row_vector = [True,False,True] * 3
print(bool_row_vector)

[True, False, True, True, False, True, True, False, True]

In [119]:
df1[bool_row_vector]

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Indi_Services        954  733.0  609  Gov   13023  NCR

In [120]:
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Indi_Services        954  733.0  609  Gov   13023  NCR

In [121]:
df1[df1.Vol > 925]

                     Vol    Rev  Exp Catg  EmpCnt   HQ
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Indi_Services        954  733.0  609  Gov   13023  NCR

In [122]:
df1[(df1.Vol > 925) & (df1.Catg=='Pub') ]

                   Vol    Rev  Exp Catg  EmpCnt   HQ
NCR_Leagles        931  863.5  605  Pub    1935  NCR
Chennai_Shipping   992  821.0  665  Pub    1154  Che
Chennai_Chemicals  966  863.2  608  Pub    1656  Che

In [123]:
df1.Rev.max()

917.0

In [124]:
#give the company with max rev
df1[df1.Rev == df1.Rev.max()]

                Vol    Rev  Exp Catg  EmpCnt   HQ
Bombay_Finance  899  917.0  674  Pub    1443  Mum

In [125]:
df1.Rev.mean()

844.2777777777778

In [126]:
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Indi_Services        954  733.0  609  Gov   13023  NCR

In [127]:
df1['Bombay_Sporting':'Bombay_Sporting']['Rev']

Bombay_Sporting    839.8
Name: Rev, dtype: float64

In [128]:
df1['Rev']['Bombay_Sporting']

839.8

# iloc

In [129]:
df1 = pd.read_csv("lds1.csv")

In [130]:
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Indi_Services        954  733.0  609  Gov   13023  NCR

In [132]:
df1.iloc[0]        #returns row no 0

Vol         900
Rev       874.4
Exp         676
Catg        Pub
EmpCnt     1379
HQ          Kol
Name: Kolkata_FMCG, dtype: object

In [133]:
df1.iloc[0,0]

900

In [134]:
df1.iloc[2,5]

'Mum'

In [135]:
df1.iloc[2:5]

                   Vol    Rev  Exp Catg  EmpCnt   HQ
Bombay_Sporting    925  839.8  615  Pvt     154  Mum
Bombay_Finance     899  917.0  674  Pub    1443  Mum
Bangalore_Systems  931  881.6  650  Gov    1361  Blr

In [136]:
df1.index[2:5]

Index(['Bombay_Sporting', 'Bombay_Finance', 'Bangalore_Systems'], dtype='object')

In [138]:
df1.iloc[2:5 , 2:5]

                   Exp Catg  EmpCnt
Bombay_Sporting    615  Pvt     154
Bombay_Finance     674  Pub    1443
Bangalore_Systems  650  Gov    1361

In [139]:
df1.index[2:5]

Index(['Bombay_Sporting', 'Bombay_Finance', 'Bangalore_Systems'], dtype='object')

In [141]:
df1.columns[2:5]

Index(['Exp', 'Catg', 'EmpCnt'], dtype='object')

In [142]:
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Indi_Services        954  733.0  609  Gov   13023  NCR

In [147]:
df1.iloc[[0,-1,2,5]]

                  Vol    Rev  Exp Catg  EmpCnt   HQ
Kolkata_FMCG      900  874.4  676  Pub    1379  Kol
Indi_Services     954  733.0  609  Gov   13023  NCR
Bombay_Sporting   925  839.8  615  Pvt     154  Mum
Chennai_Shipping  992  821.0  665  Pub    1154  Che

In [148]:
df1.index[[0,-1,2,5]]

Index(['Kolkata_FMCG', 'Indi_Services', 'Bombay_Sporting', 'Chennai_Shipping'], dtype='object')

In [149]:
df1.iloc[[0,-1,2,5],[0,-1,2,4]]

                  Vol   HQ  Exp  EmpCnt
Kolkata_FMCG      900  Kol  676    1379
Indi_Services     954  NCR  609   13023
Bombay_Sporting   925  Mum  615     154
Chennai_Shipping  992  Che  665    1154

In [ ]:
df1.iloc[]

# Label based indexing - loc

In [151]:
df1 = pd.read_csv("lds1.csv")

In [152]:
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Indi_Services        954  733.0  609  Gov   13023  NCR

In [153]:
df1.loc["Bombay_Sporting"]

Vol         925
Rev       839.8
Exp         615
Catg        Pvt
EmpCnt      154
HQ          Mum
Name: Bombay_Sporting, dtype: object

In [154]:
df1.loc["Bombay_Sporting" , "Rev"]

839.8

In [155]:
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Indi_Services        954  733.0  609  Gov   13023  NCR

In [156]:
df1.loc["Bombay_Sporting":"Chennai_Chemicals":2]

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr

In [157]:
df1.loc["Bombay_Sporting":"Chennai_Chemicals"]

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che

In [158]:
df1.loc["Bombay_Sporting":"Chennai_Chemicals" , "Rev" : "Catg"]

                       Rev  Exp Catg
Bombay_Sporting      839.8  615  Pvt
Bombay_Finance       917.0  674  Pub
Bangalore_Systems    881.6  650  Gov
Chennai_Shipping     821.0  665  Pub
Bangalore_Breweries  805.0  895  Pvt
Chennai_Chemicals    863.2  608  Pub

In [159]:
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Indi_Services        954  733.0  609  Gov   13023  NCR

In [160]:
df1.loc[["NCR_Leagles","Bangalore_Breweries","Bombay_Finance"]]

                     Vol    Rev  Exp Catg  EmpCnt   HQ
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Bombay_Finance       899  917.0  674  Pub    1443  Mum

In [161]:
df1.loc[["NCR_Leagles","Bangalore_Breweries","Bombay_Finance"] , ["Exp","HQ"]]

                     Exp   HQ
NCR_Leagles          605  NCR
Bangalore_Breweries  895  Blr
Bombay_Finance       674  Mum

In [162]:
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Indi_Services        954  733.0  609  Gov   13023  NCR

In [163]:
df1.loc["Bombay_Sporting":"Chennai_Chemicals" , "Vol"]

Bombay_Sporting        925
Bombay_Finance         899
Bangalore_Systems      931
Chennai_Shipping       992
Bangalore_Breweries    966
Chennai_Chemicals      966
Name: Vol, dtype: int64

In [165]:
df1.iloc[1 , [0,3]]

Vol     931
Catg    Pub
Name: NCR_Leagles, dtype: object

In [166]:
df1.iloc[ : , [2,3]]

                     Exp Catg
Kolkata_FMCG         676  Pub
NCR_Leagles          605  Pub
Bombay_Sporting      615  Pvt
Bombay_Finance       674  Pub
Bangalore_Systems    650  Gov
Chennai_Shipping     665  Pub
Bangalore_Breweries  895  Pvt
Chennai_Chemicals    608  Pub
Indi_Services        609  Gov

# Condition BAsed Access

In [167]:
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Indi_Services        954  733.0  609  Gov   13023  NCR

In [168]:
bool_row_vector

[True, False, True, True, False, True, True, False, True]

In [171]:
bool_col_vector = [True,False] * 3
bool_col_vector

[True, False, True, False, True, False]

In [173]:
df1.iloc[bool_row_vector , bool_col_vector]

                     Vol  Exp  EmpCnt
Kolkata_FMCG         900  676    1379
Bombay_Sporting      925  615     154
Bombay_Finance       899  674    1443
Chennai_Shipping     992  665    1154
Bangalore_Breweries  966  895     119
Indi_Services        954  609   13023

In [174]:
df1.loc[df1.Vol > 925 ,"Catg"]

NCR_Leagles            Pub
Bangalore_Systems      Gov
Chennai_Shipping       Pub
Bangalore_Breweries    Pvt
Chennai_Chemicals      Pub
Indi_Services          Gov
Name: Catg, dtype: object

In [175]:
df1.columns

Index(['Vol', 'Rev', 'Exp', 'Catg', 'EmpCnt', 'HQ'], dtype='object')

In [176]:
df1.columns.dtype

dtype('O')

In [177]:
df1.loc[(df1.Vol>925) & (df1.Catg=='Pub') , 'HQ']

NCR_Leagles          NCR
Chennai_Shipping     Che
Chennai_Chemicals    Che
Name: HQ, dtype: object

In [178]:
df1.loc[(df1.Vol>925) & (df1.Catg=='Pub') , ['HQ','EmpCnt']]

                    HQ  EmpCnt
NCR_Leagles        NCR    1935
Chennai_Shipping   Che    1154
Chennai_Chemicals  Che    1656

In [179]:
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Indi_Services        954  733.0  609  Gov   13023  NCR

In [180]:
df1.loc[df1.Exp == df1.Exp.min() , "HQ"]

NCR_Leagles    NCR
Name: HQ, dtype: object

In [183]:
df1.Rev - df1.Exp

Kolkata_FMCG           198.4
NCR_Leagles            258.5
Bombay_Sporting        224.8
Bombay_Finance         243.0
Bangalore_Systems      231.6
Chennai_Shipping       156.0
Bangalore_Breweries    -90.0
Chennai_Chemicals      255.2
Indi_Services          124.0
dtype: float64

In [184]:
df1["Profit"] = df1.Rev - df1.Exp

In [185]:
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ  Profit
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol   198.4
NCR_Leagles          931  863.5  605  Pub    1935  NCR   258.5
Bombay_Sporting      925  839.8  615  Pvt     154  Mum   224.8
Bombay_Finance       899  917.0  674  Pub    1443  Mum   243.0
Bangalore_Systems    931  881.6  650  Gov    1361  Blr   231.6
Chennai_Shipping     992  821.0  665  Pub    1154  Che   156.0
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr   -90.0
Chennai_Chemicals    966  863.2  608  Pub    1656  Che   255.2
Indi_Services        954  733.0  609  Gov   13023  NCR   124.0

In [186]:
df1.loc[df1.Profit == df1.Profit.max()]

             Vol    Rev  Exp Catg  EmpCnt   HQ  Profit
NCR_Leagles  931  863.5  605  Pub    1935  NCR   258.5

# Read Write file Format

In [187]:
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ  Profit
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol   198.4
NCR_Leagles          931  863.5  605  Pub    1935  NCR   258.5
Bombay_Sporting      925  839.8  615  Pvt     154  Mum   224.8
Bombay_Finance       899  917.0  674  Pub    1443  Mum   243.0
Bangalore_Systems    931  881.6  650  Gov    1361  Blr   231.6
Chennai_Shipping     992  821.0  665  Pub    1154  Che   156.0
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr   -90.0
Chennai_Chemicals    966  863.2  608  Pub    1656  Che   255.2
Indi_Services        954  733.0  609  Gov   13023  NCR   124.0

In [188]:
df1.to_csv('file.csv')   #check the home page jupyter nb we get a csv file

In [189]:
df1.to_excel('file.xlsx')

In [190]:
df1.to_html('file.html')

In [191]:
df1.to_json('file.json')

In [192]:
df2 = pd.read_excel('file.xlsx')
df2

            Unnamed: 0  Vol    Rev  Exp Catg  EmpCnt   HQ  Profit
0         Kolkata_FMCG  900  874.4  676  Pub    1379  Kol   198.4
1          NCR_Leagles  931  863.5  605  Pub    1935  NCR   258.5
2      Bombay_Sporting  925  839.8  615  Pvt     154  Mum   224.8
3       Bombay_Finance  899  917.0  674  Pub    1443  Mum   243.0
4    Bangalore_Systems  931  881.6  650  Gov    1361  Blr   231.6
5     Chennai_Shipping  992  821.0  665  Pub    1154  Che   156.0
6  Bangalore_Breweries  966  805.0  895  Pvt     119  Blr   -90.0
7    Chennai_Chemicals  966  863.2  608  Pub    1656  Che   255.2
8        Indi_Services  954  733.0  609  Gov   13023  NCR   124.0

In [194]:
#we need to tell that Unnamed 0 column treat it as index ==> set index_col = 0
df2 = pd.read_excel('file.xlsx' , index_col = 0)
df2

                     Vol    Rev  Exp Catg  EmpCnt   HQ  Profit
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol   198.4
NCR_Leagles          931  863.5  605  Pub    1935  NCR   258.5
Bombay_Sporting      925  839.8  615  Pvt     154  Mum   224.8
Bombay_Finance       899  917.0  674  Pub    1443  Mum   243.0
Bangalore_Systems    931  881.6  650  Gov    1361  Blr   231.6
Chennai_Shipping     992  821.0  665  Pub    1154  Che   156.0
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr   -90.0
Chennai_Chemicals    966  863.2  608  Pub    1656  Che   255.2
Indi_Services        954  733.0  609  Gov   13023  NCR   124.0

In [199]:
df2 = pd.read_html("file.html", index_col=0)
df2

[                     Vol    Rev  Exp Catg  EmpCnt   HQ  Profit
 Kolkata_FMCG         900  874.4  676  Pub    1379  Kol   198.4
 NCR_Leagles          931  863.5  605  Pub    1935  NCR   258.5
 Bombay_Sporting      925  839.8  615  Pvt     154  Mum   224.8
 Bombay_Finance       899  917.0  674  Pub    1443  Mum   243.0
 Bangalore_Systems    931  881.6  650  Gov    1361  Blr   231.6
 Chennai_Shipping     992  821.0  665  Pub    1154  Che   156.0
 Bangalore_Breweries  966  805.0  895  Pvt     119  Blr   -90.0
 Chennai_Chemicals    966  863.2  608  Pub    1656  Che   255.2
 Indi_Services        954  733.0  609  Gov   13023  NCR   124.0]

In [208]:
df2 = pd.read_html("file.html", index_col=0)
print(df2)
print()
print(type(df2))
print()
print(len(df2))

[                     Vol    Rev  Exp Catg  EmpCnt   HQ  Profit
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol   198.4
NCR_Leagles          931  863.5  605  Pub    1935  NCR   258.5
Bombay_Sporting      925  839.8  615  Pvt     154  Mum   224.8
Bombay_Finance       899  917.0  674  Pub    1443  Mum   243.0
Bangalore_Systems    931  881.6  650  Gov    1361  Blr   231.6
Chennai_Shipping     992  821.0  665  Pub    1154  Che   156.0
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr   -90.0
Chennai_Chemicals    966  863.2  608  Pub    1656  Che   255.2
Indi_Services        954  733.0  609  Gov   13023  NCR   124.0]

<class 'list'>

1

In [200]:
df2 = pd.read_html("file.html", index_col=0)[0]
df2

                     Vol    Rev  Exp Catg  EmpCnt   HQ  Profit
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol   198.4
NCR_Leagles          931  863.5  605  Pub    1935  NCR   258.5
Bombay_Sporting      925  839.8  615  Pvt     154  Mum   224.8
Bombay_Finance       899  917.0  674  Pub    1443  Mum   243.0
Bangalore_Systems    931  881.6  650  Gov    1361  Blr   231.6
Chennai_Shipping     992  821.0  665  Pub    1154  Che   156.0
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr   -90.0
Chennai_Chemicals    966  863.2  608  Pub    1656  Che   255.2
Indi_Services        954  733.0  609  Gov   13023  NCR   124.0

In [203]:
df2 = pd.read_json('file.json')
df2

                     Vol    Rev  Exp Catg  EmpCnt   HQ  Profit
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol   198.4
NCR_Leagles          931  863.5  605  Pub    1935  NCR   258.5
Bombay_Sporting      925  839.8  615  Pvt     154  Mum   224.8
Bombay_Finance       899  917.0  674  Pub    1443  Mum   243.0
Bangalore_Systems    931  881.6  650  Gov    1361  Blr   231.6
Chennai_Shipping     992  821.0  665  Pub    1154  Che   156.0
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr   -90.0
Chennai_Chemicals    966  863.2  608  Pub    1656  Che   255.2
Indi_Services        954  733.0  609  Gov   13023  NCR   124.0

# Sorting

In [210]:
df1 = pd.read_csv('lds1.csv')
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Indi_Services        954  733.0  609  Gov   13023  NCR

In [211]:
int(True)

1

In [212]:
int(False)

0

In [213]:
(df1.Vol>925)

Kolkata_FMCG           False
NCR_Leagles             True
Bombay_Sporting        False
Bombay_Finance         False
Bangalore_Systems       True
Chennai_Shipping        True
Bangalore_Breweries     True
Chennai_Chemicals       True
Indi_Services           True
Name: Vol, dtype: bool

In [214]:
(df1.Catg == 'Pub')

Kolkata_FMCG            True
NCR_Leagles             True
Bombay_Sporting        False
Bombay_Finance          True
Bangalore_Systems      False
Chennai_Shipping        True
Bangalore_Breweries    False
Chennai_Chemicals       True
Indi_Services          False
Name: Catg, dtype: bool

In [215]:
(df1.Vol>925) & (df1.Catg == 'Pub')

Kolkata_FMCG           False
NCR_Leagles             True
Bombay_Sporting        False
Bombay_Finance         False
Bangalore_Systems      False
Chennai_Shipping        True
Bangalore_Breweries    False
Chennai_Chemicals       True
Indi_Services          False
dtype: bool

In [216]:
df1.sort_index()       #bydefault sorts on index  and bydefault its ascending order

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Indi_Services        954  733.0  609  Gov   13023  NCR
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
NCR_Leagles          931  863.5  605  Pub    1935  NCR

In [217]:
df1.sort_index(axis = 'columns')

                    Catg  EmpCnt  Exp   HQ    Rev  Vol
Kolkata_FMCG         Pub    1379  676  Kol  874.4  900
NCR_Leagles          Pub    1935  605  NCR  863.5  931
Bombay_Sporting      Pvt     154  615  Mum  839.8  925
Bombay_Finance       Pub    1443  674  Mum  917.0  899
Bangalore_Systems    Gov    1361  650  Blr  881.6  931
Chennai_Shipping     Pub    1154  665  Che  821.0  992
Bangalore_Breweries  Pvt     119  895  Blr  805.0  966
Chennai_Chemicals    Pub    1656  608  Che  863.2  966
Indi_Services        Gov   13023  609  NCR  733.0  954

In [219]:
df1.sort_index(axis = 'index' , ascending = False)

                     Vol    Rev  Exp Catg  EmpCnt   HQ
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
Indi_Services        954  733.0  609  Gov   13023  NCR
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr

# if we set inplace = True , then changes are made in original object

In [220]:
df1 = pd.read_csv('lds1.csv')
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Indi_Services        954  733.0  609  Gov   13023  NCR

In [224]:
df2 = df1.sort_values(by = 'Vol' , axis = 0 ,ascending = True, inplace = False)
df2

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Indi_Services        954  733.0  609  Gov   13023  NCR
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Chennai_Shipping     992  821.0  665  Pub    1154  Che

In [ ]:
#while sorting there is clash for eg: 931,931 consider secondary column
#if at all sorting happens on vol and clash occurs then sort on rev ascending

In [225]:
df2 = df1.sort_values(by = ['Vol','Rev'] , axis = 0 ,ascending = [True,True] , inplace = False)
df2

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Indi_Services        954  733.0  609  Gov   13023  NCR
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Chennai_Shipping     992  821.0  665  Pub    1154  Che

In [226]:
df2 = df1.sort_values(by = ['Vol','Rev'] , axis = 0 ,ascending = [True,False] , inplace = False)
df2

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Indi_Services        954  733.0  609  Gov   13023  NCR
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Shipping     992  821.0  665  Pub    1154  Che

In [227]:
df1.sort_values(by="Bombay_Sporting", axis = 1)

TypeError: '>' not supported between instances of 'numpy.ndarray' and 'str'

In [228]:
1 > 'hello'

TypeError: '>' not supported between instances of 'int' and 'str'

In [229]:
#solution
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Indi_Services        954  733.0  609  Gov   13023  NCR

In [231]:
df1[['Vol','Rev','EmpCnt']].sort_values(by="Bombay_Sporting" , axis = 1)

                     EmpCnt    Rev  Vol
Kolkata_FMCG           1379  874.4  900
NCR_Leagles            1935  863.5  931
Bombay_Sporting         154  839.8  925
Bombay_Finance         1443  917.0  899
Bangalore_Systems      1361  881.6  931
Chennai_Shipping       1154  821.0  992
Bangalore_Breweries     119  805.0  966
Chennai_Chemicals      1656  863.2  966
Indi_Services         13023  733.0  954

In [232]:
df1.select_dtypes(include='number')    #select only numericla data int and float comes

                     Vol    Rev  Exp  EmpCnt
Kolkata_FMCG         900  874.4  676    1379
NCR_Leagles          931  863.5  605    1935
Bombay_Sporting      925  839.8  615     154
Bombay_Finance       899  917.0  674    1443
Bangalore_Systems    931  881.6  650    1361
Chennai_Shipping     992  821.0  665    1154
Bangalore_Breweries  966  805.0  895     119
Chennai_Chemicals    966  863.2  608    1656
Indi_Services        954  733.0  609   13023

In [233]:
#dont want float
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, Kolkata_FMCG to Indi_Services
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Vol     9 non-null      int64
 1   Rev     9 non-null      float64
 2   Exp     9 non-null      int64
 3   Catg    9 non-null      object
 4   EmpCnt  9 non-null      int64
 5   HQ      9 non-null      object
dtypes: float64(1), int64(3), object(2)
memory usage: 824.0+ bytes

In [234]:
df1.select_dtypes(include =  np.int64)

                     Vol  Exp  EmpCnt
Kolkata_FMCG         900  676    1379
NCR_Leagles          931  605    1935
Bombay_Sporting      925  615     154
Bombay_Finance       899  674    1443
Bangalore_Systems    931  650    1361
Chennai_Shipping     992  665    1154
Bangalore_Breweries  966  895     119
Chennai_Chemicals    966  608    1656
Indi_Services        954  609   13023

In [235]:
df1.select_dtypes(include='number').sort_values(by = "Bangalore_Breweries", axis = 1)

                     EmpCnt    Rev  Exp  Vol
Kolkata_FMCG           1379  874.4  676  900
NCR_Leagles            1935  863.5  605  931
Bombay_Sporting         154  839.8  615  925
Bombay_Finance         1443  917.0  674  899
Bangalore_Systems      1361  881.6  650  931
Chennai_Shipping       1154  821.0  665  992
Bangalore_Breweries     119  805.0  895  966
Chennai_Chemicals      1656  863.2  608  966
Indi_Services         13023  733.0  609  954

In [236]:
df1.select_dtypes(include='object').sort_values(by = "Bangalore_Breweries", axis = 1)

                      HQ Catg
Kolkata_FMCG         Kol  Pub
NCR_Leagles          NCR  Pub
Bombay_Sporting      Mum  Pvt
Bombay_Finance       Mum  Pub
Bangalore_Systems    Blr  Gov
Chennai_Shipping     Che  Pub
Bangalore_Breweries  Blr  Pvt
Chennai_Chemicals    Che  Pub
Indi_Services        NCR  Gov

# Ranking

In [237]:
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Indi_Services        954  733.0  609  Gov   13023  NCR

In [238]:
df1.Vol.rank(axis = 0)

Kolkata_FMCG           2.0
NCR_Leagles            4.5
Bombay_Sporting        3.0
Bombay_Finance         1.0
Bangalore_Systems      4.5
Chennai_Shipping       9.0
Bangalore_Breweries    7.5
Chennai_Chemicals      7.5
Indi_Services          6.0
Name: Vol, dtype: float64

In [ ]:
df1['vol_rank'] = df1.Vol.rank(axis = 0, method = 'average',ascending = True)  #bydefault is average

In [239]:
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Indi_Services        954  733.0  609  Gov   13023  NCR

In [241]:
df1['vol_rank'] = df1.Vol.rank(axis = 0, method = 'average',ascending = False) 
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ  vol_rank
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol       8.0
NCR_Leagles          931  863.5  605  Pub    1935  NCR       5.5
Bombay_Sporting      925  839.8  615  Pvt     154  Mum       7.0
Bombay_Finance       899  917.0  674  Pub    1443  Mum       9.0
Bangalore_Systems    931  881.6  650  Gov    1361  Blr       5.5
Chennai_Shipping     992  821.0  665  Pub    1154  Che       1.0
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr       2.5
Chennai_Chemicals    966  863.2  608  Pub    1656  Che       2.5
Indi_Services        954  733.0  609  Gov   13023  NCR       4.0

In [242]:
df1['exp_rank'] = df1.Exp.rank(axis = 0, method = 'average',ascending = True) 
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ  vol_rank  exp_rank
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol       8.0       8.0
NCR_Leagles          931  863.5  605  Pub    1935  NCR       5.5       1.0
Bombay_Sporting      925  839.8  615  Pvt     154  Mum       7.0       4.0
Bombay_Finance       899  917.0  674  Pub    1443  Mum       9.0       7.0
Bangalore_Systems    931  881.6  650  Gov    1361  Blr       5.5       5.0
Chennai_Shipping     992  821.0  665  Pub    1154  Che       1.0       6.0
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr       2.5       9.0
Chennai_Chemicals    966  863.2  608  Pub    1656  Che       2.5       2.0
Indi_Services        954  733.0  609  Gov   13023  NCR       4.0       3.0

In [243]:
df1['vol_rank'] = df1.Vol.rank(axis = 0, method = 'dense',ascending = False) 
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ  vol_rank  exp_rank
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol       6.0       8.0
NCR_Leagles          931  863.5  605  Pub    1935  NCR       4.0       1.0
Bombay_Sporting      925  839.8  615  Pvt     154  Mum       5.0       4.0
Bombay_Finance       899  917.0  674  Pub    1443  Mum       7.0       7.0
Bangalore_Systems    931  881.6  650  Gov    1361  Blr       4.0       5.0
Chennai_Shipping     992  821.0  665  Pub    1154  Che       1.0       6.0
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr       2.0       9.0
Chennai_Chemicals    966  863.2  608  Pub    1656  Che       2.0       2.0
Indi_Services        954  733.0  609  Gov   13023  NCR       3.0       3.0

In [244]:
df1.rank()   #get rank value based ondefault settings

                     Vol  Rev  Exp  Catg  EmpCnt   HQ  vol_rank  exp_rank
Kolkata_FMCG         2.0  7.0  8.0   5.0     5.0  5.0       8.0       8.0
NCR_Leagles          4.5  6.0  1.0   5.0     8.0  8.5       5.5       1.0
Bombay_Sporting      3.0  4.0  4.0   8.5     2.0  6.5       7.0       4.0
Bombay_Finance       1.0  9.0  7.0   5.0     6.0  6.5       9.0       7.0
Bangalore_Systems    4.5  8.0  5.0   1.5     4.0  1.5       5.5       5.0
Chennai_Shipping     9.0  3.0  6.0   5.0     3.0  3.5       1.0       6.0
Bangalore_Breweries  7.5  2.0  9.0   8.5     1.0  1.5       2.5       9.0
Chennai_Chemicals    7.5  5.0  2.0   5.0     7.0  3.5       2.5       2.0
Indi_Services        6.0  1.0  3.0   1.5     9.0  8.5       4.0       3.0

In [245]:
df1.Catg

Kolkata_FMCG           Pub
NCR_Leagles            Pub
Bombay_Sporting        Pvt
Bombay_Finance         Pub
Bangalore_Systems      Gov
Chennai_Shipping       Pub
Bangalore_Breweries    Pvt
Chennai_Chemicals      Pub
Indi_Services          Gov
Name: Catg, dtype: object

In [247]:
df1[['Vol','Rev']].rank(axis=0,method = 'average', ascending = False)

                     Vol  Rev
Kolkata_FMCG         8.0  3.0
NCR_Leagles          5.5  4.0
Bombay_Sporting      7.0  6.0
Bombay_Finance       9.0  1.0
Bangalore_Systems    5.5  2.0
Chennai_Shipping     1.0  7.0
Bangalore_Breweries  2.5  8.0
Chennai_Chemicals    2.5  5.0
Indi_Services        4.0  9.0

In [249]:
df1[['vrank','rrank']]=df1[['Vol','Rev']].rank(axis=0,method = 'average', ascending = False)
df1

,Vol,Rev,Exp,Catg,EmpCnt,HQ,vol_rank,exp_rank,vrank,rrank
Kolkata_FMCG,900,874.4,676,Pub,1379,Kol,6.0,8.0,8.0,3.0
NCR_Leagles,931,863.5,605,Pub,1935,NCR,4.0,1.0,5.5,4.0
Bombay_Sporting,925,839.8,615,Pvt,154,Mum,5.0,4.0,7.0,6.0
Bombay_Finance,899,917.0,674,Pub,1443,Mum,7.0,7.0,9.0,1.0
Bangalore_Systems,931,881.6,650,Gov,1361,Blr,4.0,5.0,5.5,2.0
Chennai_Shipping,992,821.0,665,Pub,1154,Che,1.0,6.0,1.0,7.0
Bangalore_Breweries,966,805.0,895,Pvt,119,Blr,2.0,9.0,2.5,8.0
Chennai_Chemicals,966,863.2,608,Pub,1656,Che,2.0,2.0,2.5,5.0
Indi_Services,954,733.0,609,Gov,13023,NCR,3.0,3.0,4.0,9.0

# Dropping

In [251]:
df1 = pd.read_csv('lds1.csv')
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Indi_Services        954  733.0  609  Gov   13023  NCR

In [252]:
df1.drop(labels = 'Exp' , axis = 1)

                     Vol    Rev Catg  EmpCnt   HQ
Kolkata_FMCG         900  874.4  Pub    1379  Kol
NCR_Leagles          931  863.5  Pub    1935  NCR
Bombay_Sporting      925  839.8  Pvt     154  Mum
Bombay_Finance       899  917.0  Pub    1443  Mum
Bangalore_Systems    931  881.6  Gov    1361  Blr
Chennai_Shipping     992  821.0  Pub    1154  Che
Bangalore_Breweries  966  805.0  Pvt     119  Blr
Chennai_Chemicals    966  863.2  Pub    1656  Che
Indi_Services        954  733.0  Gov   13023  NCR

In [253]:
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Indi_Services        954  733.0  609  Gov   13023  NCR

In [254]:
df1.drop(labels = ['Exp','HQ'] , axis = 1)

                     Vol    Rev Catg  EmpCnt
Kolkata_FMCG         900  874.4  Pub    1379
NCR_Leagles          931  863.5  Pub    1935
Bombay_Sporting      925  839.8  Pvt     154
Bombay_Finance       899  917.0  Pub    1443
Bangalore_Systems    931  881.6  Gov    1361
Chennai_Shipping     992  821.0  Pub    1154
Bangalore_Breweries  966  805.0  Pvt     119
Chennai_Chemicals    966  863.2  Pub    1656
Indi_Services        954  733.0  Gov   13023

In [255]:
df1.drop(labels = ['Exp','Bangalore_Breweries'] , axis = 1)

KeyError: "['Bangalore_Breweries'] not found in axis"

In [256]:
df1.drop(labels = ['Chennai_Chemicals','Bangalore_Breweries'] , axis = 0)

                   Vol    Rev  Exp Catg  EmpCnt   HQ
Kolkata_FMCG       900  874.4  676  Pub    1379  Kol
NCR_Leagles        931  863.5  605  Pub    1935  NCR
Bombay_Sporting    925  839.8  615  Pvt     154  Mum
Bombay_Finance     899  917.0  674  Pub    1443  Mum
Bangalore_Systems  931  881.6  650  Gov    1361  Blr
Chennai_Shipping   992  821.0  665  Pub    1154  Che
Indi_Services      954  733.0  609  Gov   13023  NCR

In [257]:
df1

                     Vol    Rev  Exp Catg  EmpCnt   HQ
Kolkata_FMCG         900  874.4  676  Pub    1379  Kol
NCR_Leagles          931  863.5  605  Pub    1935  NCR
Bombay_Sporting      925  839.8  615  Pvt     154  Mum
Bombay_Finance       899  917.0  674  Pub    1443  Mum
Bangalore_Systems    931  881.6  650  Gov    1361  Blr
Chennai_Shipping     992  821.0  665  Pub    1154  Che
Bangalore_Breweries  966  805.0  895  Pvt     119  Blr
Chennai_Chemicals    966  863.2  608  Pub    1656  Che
Indi_Services        954  733.0  609  Gov   13023  NCR

In [258]:
df1.drop(index = ['Bangalore_Systems','Bangalore_Breweries'] ,columns=['Exp','EmpCnt','HQ'])

                   Vol    Rev Catg
Kolkata_FMCG       900  874.4  Pub
NCR_Leagles        931  863.5  Pub
Bombay_Sporting    925  839.8  Pvt
Bombay_Finance     899  917.0  Pub
Chennai_Shipping   992  821.0  Pub
Chennai_Chemicals  966  863.2  Pub
Indi_Services      954  733.0  Gov